[
  {
    "code": "PONA",
    "name": "파워 전위의 정교한 도전자",
    "color": "#EF6B6B",
    "nickname": "임팩트 메이커",
    "description": "강한 임팩트와 네트 대시로 압박을 가하며, 결정적인 순간에 승부수를 띄우는 플레이를 선호하는 성향입니다. 단순한 힘 자랑이 아닌, 정해진 시나리오에 따라 계획적으로 움직이며 흐름을 컨트롤하려는 성향이 강합니다. 계산된 전위 플레이와 안정적인 임팩트 조율이 특징입니다.",
    "improvement_tip": "상대가 예상하지 못한 변칙 전술이나 감각 중심의 플레이에 흐름이 끊기는 경우가 있으므로, 리스크를 감수하며 즉흥적인 대응 능력을 키우는 것이 필요합니다.",
    "compatibility": [
      {
        "code": "PONE",
        "value": 70,
        "reason": "비슷한 전위 중심 성향으로 강한 압박이 가능하지만, 주도권을 두고 충돌이 생길 수 있습니다."
      },
      {
        "code": "POBA",
        "value": 80,
        "reason": "강력한 후위 지원을 바탕으로 안정적인 흐름 속에 공격 기회를 만들어낼 수 있어 조합이 뛰어납니다."
      },
      {
        "code": "POBE",
        "value": 85,
        "reason": "POBE의 전략적 후위 설계가 PONA의 전위 압박 플레이를 완벽하게 받쳐주어 강한 전술 밸런스를 이룹니다."
      },
      {
        "code": "PINA",
        "value": 60,
        "reason": "두 명 모두 전위 성향이지만, 감각 위주의 즉흥성과 계획 중심의 사고방식이 충돌할 수 있습니다."
      },
      {
        "code": "PINE",
        "value": 55,
        "reason": "전위 포지션과 감각 중심 성향이 겹쳐 조직적 운영이 어려워질 수 있습니다."
      },
      {
        "code": "PIBA",
        "value": 65,
        "reason": "후위에서 감각적으로 대응하는 스타일이지만 예측 불가능성이 높아, 정교한 흐름이 흐트러질 수 있습니다."
      },
      {
        "code": "PIBE",
        "value": 60,
        "reason": "감각 중심의 후위 플레이와 계산된 전위 전략이 매끄럽게 어울리지 않아 리듬이 깨질 수 있습니다."
      },
      {
        "code": "CONA",
        "value": 75,
        "reason": "정확한 전위 전략과 강한 임팩트가 조화를 이루지만, 전술 방향에서 이견이 생길 수 있습니다."
      },
      {
        "code": "CONE",
        "value": 85,
        "reason": "정확하고 전략적인 전위 설계자와의 협업은 더 정교한 전위-전위 운영이 가능하게 해줍니다."
      },
      {
        "code": "COBA",
        "value": 90,
        "reason": "전술 중심의 후위 파트너가 안정된 기반을 만들어주어 PONA의 공격이 더욱 효율적으로 작동합니다."
      },
      {
        "code": "COBE",
        "value": 95,
        "reason": "COBE의 안정적이고 세밀한 조율이 PONA의 전위 플레이를 극대화하며 최고의 밸런스를 이룹니다."
      },
      {
        "code": "CINA",
        "value": 70,
        "reason": "감각적이면서도 전략적 기반이 있는 전위 플레이어로 전술적 융합이 가능하지만 약간의 리듬 충돌이 있을 수 있습니다."
      },
      {
        "code": "CINE",
        "value": 90,
        "reason": "감각적인 후위 커버 능력이 뛰어나며, 전위에서의 과감한 움직임을 자연스럽게 서포트해 줍니다."
      },
      {
        "code": "CIBA",
        "value": 80,
        "reason": "감각적인 후위 파트너로서 흐름을 부드럽게 이어가고, 공격적인 움직임에 안정성을 더해줍니다."
      },
      {
        "code": "CIBE",
        "value": 85,
        "reason": "유연하면서도 안정된 후위 운영이 가능해, PONA의 전위 중심 전략과 이상적인 전후위 조합을 형성할 수 있습니다."
      }
    ]
  },
  {
    "code": "PONE",
    "name": "파워 전위의 즐기는 전략가",
    "color": "#F28E63",
    "nickname": "스매싱 플래너",
    "description": "강한 임팩트로 빠르게 흐름을 가져오고, 네트 앞에서 승부수를 띄우는 데 능한 성향입니다. 즉흥보다는 미리 계획된 시나리오 속에서 전위를 장악하고, 경기를 주도해 나가는 스타일입니다. 결과에만 집착하기보다는 경기 자체의 몰입과 흐름에서 즐거움을 찾으며, 열정적이고 생동감 있는 플레이를 펼치는 것이 특징입니다.",
    "improvement_tip": "몰입에 강한 만큼 계획을 무너뜨리는 외부 요인(실수, 상대의 변칙 전술)에 취약할 수 있습니다. 감정 기복을 관리하고 예외 상황에도 유연하게 대처하는 훈련이 필요합니다.",
    "compatibility": [
      {
        "code": "PONA",
        "value": 70,
        "reason": "비슷한 전위 포지션으로 강한 압박이 가능하지만, 집중 방식과 흐름 리듬에서 미묘한 차이가 충돌을 유발할 수 있습니다."
      },
      {
        "code": "POBA",
        "value": 80,
        "reason": "전략적이고 파워 있는 후위 운영자와 함께 전위-후위 분업이 잘 이뤄지며, 전체 전술 밸런스가 우수합니다."
      },
      {
        "code": "POBE",
        "value": 85,
        "reason": "계획적이면서도 파워 있는 후위 스타일이 전위 몰입형인 PONE을 효과적으로 보완합니다."
      },
      {
        "code": "PINA",
        "value": 60,
        "reason": "두 명 모두 전위에 집중하며 공격을 선호하나, 감각 중심과 전략 중심 사고의 충돌로 인해 리듬이 흐려질 수 있습니다."
      },
      {
        "code": "PINE",
        "value": 55,
        "reason": "역할이 겹치고 감각적인 플레이가 전략 흐름을 깨뜨릴 가능성이 있습니다."
      },
      {
        "code": "PIBA",
        "value": 65,
        "reason": "후위 감각형이지만 예측 불가한 대응이 많아 PONE의 전략적인 시도와 어긋날 수 있습니다."
      },
      {
        "code": "PIBE",
        "value": 60,
        "reason": "감각 위주의 후위 스타일과 전략적 전위 운영이 조화를 이루기 어려워 흐름이 불안정해질 수 있습니다."
      },
      {
        "code": "CONA",
        "value": 75,
        "reason": "전위 전략가로서 통하는 면은 있지만, 결과 중시 성향의 강도가 달라 리더십 경쟁이 발생할 수 있습니다."
      },
      {
        "code": "CONE",
        "value": 85,
        "reason": "정확하고 냉정한 전위 전략가로서 PONE의 자유도 높은 플레이를 설계와 커버로 안정화해 줄 수 있습니다."
      },
      {
        "code": "COBA",
        "value": 90,
        "reason": "전술 중심의 후위 서포터로서, 전위 플레이의 흐름을 끊지 않고 자연스럽게 이어가는 데 적합합니다."
      },
      {
        "code": "COBE",
        "value": 95,
        "reason": "후방에서의 철저한 조율력과 안정성이 PONE의 몰입 플레이에 이상적인 기반이 되어 줍니다."
      },
      {
        "code": "CINA",
        "value": 70,
        "reason": "공격 템포와 직관이 비슷하지만, 즉흥성과 전략 사이에 리듬 충돌이 생길 수 있습니다."
      },
      {
        "code": "CINE",
        "value": 90,
        "reason": "감각 중심 후위 스타일로, PONE의 창의적인 네트 플레이를 유연하게 뒷받침할 수 있습니다."
      },
      {
        "code": "CIBA",
        "value": 80,
        "reason": "감각적인 후위 도전자 스타일로서 PONE의 몰입 흐름과 에너지를 효과적으로 받아줄 수 있습니다."
      },
      {
        "code": "CIBE",
        "value": 85,
        "reason": "후위의 감각적이고 안정적인 조율이 PONE의 공격 감각과 융합되어 이상적인 전후위 밸런스를 이룰 수 있습니다."
      }
    ]
  },

  {
    "code": "POBA",
    "name": "파워 후위의 전략적 설계자",
    "color": "#E15A84",
    "nickname": "설계하는 베이스라인 지휘관",
    "description": "강한 임팩트와 베이스라인 지향적 포지셔닝을 바탕으로 경기를 전략적으로 설계하고 통제하는 성향입니다. 직접적으로 공격에 나서기보다는 상대를 무너뜨릴 수 있는 시나리오를 구상하고, 후위에서 묵직하게 흐름을 만들어가는 스타일입니다.",
    "improvement_tip": "전술적인 완성도는 높지만, 예측 불가능한 즉흥적 상황이나 빠른 전환 플레이에 취약할 수 있으므로, 감각적 유연성을 키우는 것이 도움이 됩니다.",
    "compatibility": [
      {
        "code": "PONA",
        "value": 85,
        "reason": "전위에서 임팩트를 주는 PONA의 플레이를 후위에서 안정적으로 설계하며 이상적인 전후위 역할 분담이 가능합니다."
      },
      {
        "code": "PONE",
        "value": 80,
        "reason": "계획 중심의 전위 성향과 역할이 명확하게 나뉘어 강한 공격과 안정된 운영을 동시에 이룰 수 있습니다."
      },
      {
        "code": "POBE",
        "value": 75,
        "reason": "두 명 모두 후위 성향이지만, 역할을 나눠 설계 중심과 실행 중심으로 조율하면 팀의 밸런스를 유지할 수 있습니다."
      },
      {
        "code": "PINA",
        "value": 65,
        "reason": "감각 중심의 전위 파트너와는 조화가 가능하지만, 예측 불가능한 움직임이 계획적 흐름을 방해할 수 있습니다."
      },
      {
        "code": "PINE",
        "value": 60,
        "reason": "감각적인 전위 플레이와 POBA의 계획 중심 사고가 충돌할 가능성이 있으며, 리듬 불일치가 발생할 수 있습니다."
      },
      {
        "code": "PIBA",
        "value": 55,
        "reason": "후위에서 즉흥적으로 움직이는 PIBA와는 전략 리듬이 어긋날 가능성이 크며, 역할 중복도 우려됩니다."
      },
      {
        "code": "PIBE",
        "value": 60,
        "reason": "PIBE의 창의적 후위 운영은 때로 흐름을 무너뜨릴 수 있지만, 상호 존중이 있다면 보완이 가능합니다."
      },
      {
        "code": "CONA",
        "value": 80,
        "reason": "정확한 전위 플레이를 기반으로 POBA의 후위 설계를 잘 마무리해주는 안정된 조합입니다."
      },
      {
        "code": "CONE",
        "value": 85,
        "reason": "정교하고 계획적인 전위형 파트너와 함께하면, POBA의 후위 설계가 효과적으로 실행됩니다."
      },
      {
        "code": "COBA",
        "value": 70,
        "reason": "비슷한 후위 성향이지만 전략 중심 사고로 방향이 일치하며, 역할 조정 시 시너지 효과를 낼 수 있습니다."
      },
      {
        "code": "COBE",
        "value": 75,
        "reason": "정확하고 안정적인 스타일로 POBA의 전술 흐름을 잘 유지해주지만, 공격 마무리가 부족할 수 있습니다."
      },
      {
        "code": "CINA",
        "value": 65,
        "reason": "전위에서 감각적으로 움직이는 CINA와 조화를 이룰 수 있으나 즉흥성에 대비한 설계가 필요합니다."
      },
      {
        "code": "CINE",
        "value": 70,
        "reason": "감각적이고 안정적인 후위 플레이어로서 흐름 유지는 가능하나, 역할이 다소 겹칠 수 있습니다."
      },
      {
        "code": "CIBA",
        "value": 60,
        "reason": "후위 중심이면서도 감각 위주의 플레이로 인해 POBA의 통제적 운영과 리듬 충돌이 생길 수 있습니다."
      },
      {
        "code": "CIBE",
        "value": 65,
        "reason": "감각 기반의 후위 운영자와는 철저한 커뮤니케이션이 필요하며, 서로를 존중하면 보완적인 관계가 가능합니다."
      }
    ]
  },

  {
    "code": "POBE",
    "name": "강한 베이스라인을 설계하는 몰입형 전략가",
    "color": "#F17C6F",
    "nickname": "몰입하는 파워 설계자",
    "description": "강한 임팩트와 베이스라인 중심의 안정된 포지셔닝을 기반으로 경기를 몰입감 있게 설계해 나가는 성향입니다. 감정 기복 없이 자신의 리듬을 유지하며, 시나리오에 따라 정교하게 흐름을 조정하는 스타일입니다.",
    "improvement_tip": "플랜에 대한 집중도가 높은 만큼 예외 상황이나 감각적인 흐름 변화에 대응이 다소 약할 수 있으므로, 즉흥적인 상황 대처 능력을 보완하면 완성도가 높아질 수 있습니다.",
    "compatibility": [
      {
        "code": "PONA",
        "value": 80,
        "reason": "강력한 전위 돌파 성향을 가진 PONA의 전술 흐름을 후위에서 안정적으로 설계하고 지지할 수 있어 이상적인 조합입니다."
      },
      {
        "code": "PONE",
        "value": 85,
        "reason": "전위에서 전략적으로 움직이는 PONE과 함께하면 후방 설계자 POBE와 전술적으로 매우 균형 잡힌 플레이가 가능합니다."
      },
      {
        "code": "POBA",
        "value": 75,
        "reason": "비슷한 성향이지만 역할 분담이 명확하다면 두 사람의 통제력이 조화를 이루어 강한 후위 중심 팀이 될 수 있습니다."
      },
      {
        "code": "PINA",
        "value": 60,
        "reason": "감각적이고 즉흥적인 움직임은 POBE의 계획된 흐름에 혼란을 줄 수 있어 조율이 필요합니다."
      },
      {
        "code": "PINE",
        "value": 55,
        "reason": "전위 감각형인 PINE과는 플레이 흐름의 리듬이 다르며, 전술적인 완성도 면에서 충돌이 발생할 수 있습니다."
      },
      {
        "code": "PIBA",
        "value": 50,
        "reason": "같은 후위 성향이면서도 PIBA는 감각 기반이라 사고방식과 리듬이 어긋나 팀워크 형성이 어렵습니다."
      },
      {
        "code": "PIBE",
        "value": 55,
        "reason": "자유롭고 창의적인 후위 플레이는 POBE에게 불규칙함으로 작용할 수 있어 신중한 조율이 필요합니다."
      },
      {
        "code": "CONA",
        "value": 80,
        "reason": "정확하고 계획적인 전위형으로서, POBE의 후위 흐름을 신뢰성 있게 마무리해주는 파트너입니다."
      },
      {
        "code": "CONE",
        "value": 85,
        "reason": "전위에서 정교하게 움직이는 CONE과 함께하면, 후방에서 설계하는 POBE의 전략이 효과적으로 실현됩니다."
      },
      {
        "code": "COBA",
        "value": 70,
        "reason": "같은 후위 전략가로 사고방식은 유사하지만, 역할 조정이 명확하지 않으면 효율이 떨어질 수 있습니다."
      },
      {
        "code": "COBE",
        "value": 75,
        "reason": "정확하고 안정적인 후위 플레이어로서 POBE와의 공존이 가능하나, 공격 마무리에서 부족할 수 있습니다."
      },
      {
        "code": "CINA",
        "value": 65,
        "reason": "감각 중심의 전위 스타일이지만, 일정한 전략적 프레임 내에서 움직일 수 있어 조화가 가능합니다."
      },
      {
        "code": "CINE",
        "value": 70,
        "reason": "후방의 감각형이지만 안정성을 기반으로 하기 때문에 POBE의 리듬을 크게 해치지 않으며 보완 관계가 가능합니다."
      },
      {
        "code": "CIBA",
        "value": 60,
        "reason": "감각 중심의 후위 성향으로 플레이 템포와 흐름이 맞지 않을 수 있으나, 명확한 역할이 있다면 가능성은 존재합니다."
      },
      {
        "code": "CIBE",
        "value": 65,
        "reason": "자유로운 후위 스타일과는 리듬 충돌이 우려되나, 실력 기반으로 상호 보완 가능성이 있는 조합입니다."
      }
    ]
  },

  {
    "code": "PINA",
    "name": "즉흥적이고 감각적인 전위형 공격 성향",
    "color": "#E95B8E",
    "nickname": "직감으로 치고 나가는 네트파이터",
    "description": "자신의 직감과 리듬에 따라 네트 앞으로 빠르게 전진하여 공격을 시도하는 성향입니다. 세밀한 계획보다 흐름과 순간적인 판단에 의존하며, 창의적이고 예측하기 어려운 플레이를 즐깁니다.",
    "improvement_tip": "즉흥성과 감각적인 장점은 위기 상황에서의 유연함으로 연결되지만, 전략적인 상황 판단과 팀 내 역할 조율에 대한 인식이 부족하면 협업에서 어려움을 겪을 수 있습니다. 기본적인 경기 설계 능력을 보완하면 더욱 완성도 높은 플레이를 펼칠 수 있습니다.",
    "compatibility": [
      {
        "code": "PONE",
        "value": 55,
        "reason": "전위 중심이라는 포지션은 비슷하지만, PONE은 계획 중심이고 PINA는 즉흥적이기 때문에 리듬이 맞지 않을 수 있습니다."
      },
      {
        "code": "POBA",
        "value": 65,
        "reason": "POBA가 안정적인 후위 전략을 담당하고, PINA가 감각적으로 마무리를 하면 조화가 가능하지만 경기 템포가 엇갈릴 수 있습니다."
      },
      {
        "code": "POBE",
        "value": 70,
        "reason": "POBE가 설계를 맡고 PINA가 공격을 담당하면 구조는 맞지만, 감각 중심 플레이가 전략 흐름을 혼란시킬 수 있습니다."
      },
      {
        "code": "PIBA",
        "value": 78,
        "reason": "감각 중심 플레이어로서 기본 성향은 비슷하나, 둘 다 베이스라인에 남는 경우 역할 중복이 생길 수 있습니다."
      },
      {
        "code": "PIBE",
        "value": 75,
        "reason": "비슷한 감각 기반 플레이를 펼치며 흐름에 따라 협업 가능하지만, 전후위 포지션이 맞지 않으면 충돌 가능성이 있습니다."
      },
      {
        "code": "CONE",
        "value": 85,
        "reason": "CONE이 전략적으로 설계하고, PINA가 전위에서 직관적으로 치고 나가는 방식으로 균형 잡힌 전위 플레이를 할 수 있습니다."
      },
      {
        "code": "CONA",
        "value": 88,
        "reason": "CONA의 냉정한 운영이 PINA의 감각적 본능을 효과적으로 보완할 수 있으며, 전위 간 협업도 가능합니다."
      },
      {
        "code": "COBA",
        "value": 90,
        "reason": "COBA의 안정적인 후방 운영이 PINA의 전위 본능을 뒷받침하며 이상적인 전후위 조화를 이룹니다."
      },
      {
        "code": "COBE",
        "value": 92,
        "reason": "COBE가 감각적이면서도 안정적인 후위 역할을 수행하며, PINA의 즉흥적 전위 공격과 매우 잘 어울립니다."
      },
      {
        "code": "CINA",
        "value": 83,
        "reason": "CINA는 감각적이며 안정적인 전위 스타일로, 함께 전위 플레이를 나눌 수 있어 직관적 협업이 가능합니다."
      },
      {
        "code": "CINE",
        "value": 95,
        "reason": "CINE의 감각적이면서 조율력 있는 후위 플레이가 PINA의 전위 감각과 리듬을 최대한 살릴 수 있는 궁합입니다."
      },
      {
        "code": "CIBA",
        "value": 88,
        "reason": "감각 기반 성향이 비슷하고 포지션도 전후위로 구분되어 있어 직관적이고 유연한 팀워크를 구성할 수 있습니다."
      },
      {
        "code": "CIBE",
        "value": 90,
        "reason": "감각 중심 후위 플레이어로서 전위의 PINA와 조화를 이루며 자유롭고 창의적인 경기 운영이 가능합니다."
      },
      {
        "code": "PIEA",
        "value": 50,
        "reason": "같은 전위 성향에 즉흥적인 성격도 겹쳐 수비 불안정과 역할 충돌의 위험이 높습니다."
      },
      {
        "code": "PONA",
        "value": 60,
        "reason": "PONA는 계획적인 전위 스타일이라 PINA와 전위 포지션이 겹치며 경기 스타일이 충돌할 수 있습니다."
      }
    ]
  },
  {
    "code": "PINE",
    "name": "감각적이고 즉흥적인 전위 중심 플레이어",
    "color": "#F89A65",
    "nickname": "직감으로 흐름을 지배하는 네트워커",
    "description": "빠른 판단과 직관에 따라 네트 플레이를 주도하며, 상대의 허점을 날카롭게 파고드는 성향입니다. 경기 흐름을 타며 순간적인 타이밍 감각에 뛰어나고, 예측 불가능한 플레이로 상대를 압박합니다.",
    "improvement_tip": "즉흥성과 감각적인 강점은 예측 불가능성과 창의성으로 연결되지만, 전략적인 운영이 부족하면 팀 플레이에서 리듬이 깨질 수 있습니다. 수비 위치 조율과 팀 내 커뮤니케이션을 강화하면 더 완성도 높은 경기 운영이 가능합니다.",
    "compatibility": [
      {
        "code": "PONA",
        "value": 55,
        "reason": "전위 성향이 겹치며 스타일이 달라, 역할 충돌과 리듬 혼란이 발생할 수 있습니다."
      },
      {
        "code": "PONE",
        "value": 58,
        "reason": "전위 플레이어끼리 겹치며, PONE의 전략성과 PINE의 즉흥성이 충돌할 가능성이 있습니다."
      },
      {
        "code": "POBA",
        "value": 68,
        "reason": "전후위 조합은 가능하지만, 경기 템포가 다르고 흐름이 끊길 수 있어 조율이 필요합니다."
      },
      {
        "code": "POBE",
        "value": 70,
        "reason": "전후위 역할 분담은 가능하지만, PINE의 리듬이 POBE의 전략 중심 운영을 흔들 수 있습니다."
      },
      {
        "code": "PINA",
        "value": 62,
        "reason": "비슷한 성향의 전위 감각 플레이어로 협업보다는 포지션 중복과 감각 충돌 우려가 있습니다."
      },
      {
        "code": "PIBA",
        "value": 75,
        "reason": "PINE이 전위, PIBA가 후위 역할을 맡으면 감각 기반으로 유기적인 플레이가 가능하지만 수비 불안 요소가 있습니다."
      },
      {
        "code": "PIBE",
        "value": 78,
        "reason": "감각 중심 후위 스타일과의 조화는 나쁘지 않지만, 전략이 부재하면 전체 흐름이 무너질 수 있습니다."
      },
      {
        "code": "CONE",
        "value": 80,
        "reason": "CONE이 전략을 설계하고, PINE이 감각적으로 마무리하면 전위 플레이에서 좋은 시너지를 낼 수 있습니다."
      },
      {
        "code": "CONA",
        "value": 85,
        "reason": "전위 성향이 같아 조심은 필요하지만, CONA의 정밀한 운영이 PINE의 감각적 무브를 보완할 수 있습니다."
      },
      {
        "code": "COBA",
        "value": 88,
        "reason": "후위에서 전략을 조율하는 COBA가 PINE의 자유로운 전위 감각을 안정적으로 뒷받침해줍니다."
      },
      {
        "code": "COBE",
        "value": 92,
        "reason": "COBE의 안정적인 후방 운영과 PINE의 공격적 전위 감각이 조화를 이루어 전후위 이상적 조합이 됩니다."
      },
      {
        "code": "CINA",
        "value": 80,
        "reason": "비슷한 감각 성향으로 직관적인 플레이가 가능하지만 전위 성향이 겹칠 수 있어 조율이 필요합니다."
      },
      {
        "code": "CINE",
        "value": 95,
        "reason": "CINE이 감각적으로 흐름을 읽어 후방을 조율하며, PINE은 전위에서 즉흥적으로 치고 나가 완벽한 밸런스를 이룹니다."
      },
      {
        "code": "CIBA",
        "value": 87,
        "reason": "유연한 감각 기반 후위 성향과 PINE의 전위 감각이 잘 어우러지며, 창의적인 콤비 플레이가 가능합니다."
      },
      {
        "code": "CIBE",
        "value": 90,
        "reason": "감각 기반 후위 운영이 전위 중심의 PINE과 잘 어우러져 유연하고 예측 불가능한 플레이가 가능합니다."
      }
    ]
  },
  {
    "code": "PIBA",
    "name": "감각적이고 즉흥적인 후위 중심 플레이어",
    "color": "#E36C9A",
    "nickname": "유연한 랠리의 조율자",
    "description": "자신만의 리듬과 타이밍을 중시하며, 후방에서 유연하게 경기를 풀어가는 스타일입니다. 즉흥적인 상황 판단과 감각적인 샷으로 랠리를 이어가며 상대의 허점을 찌르는 데 능합니다.",
    "improvement_tip": "감각에 의존한 플레이는 창의적인 전개로 이어질 수 있지만, 전략적인 연계가 부족하면 팀 플레이에서 리스크가 커집니다. 공격적인 마무리 연습과 파트너와의 명확한 역할 분담이 필요합니다.",
    "compatibility": [
      {
        "code": "PONA",
        "value": 78,
        "reason": "PONA가 전위에서 확실한 마무리를 해주면, PIBA는 후위에서 유연하게 흐름을 만들어 이상적인 조화를 이룹니다."
      },
      {
        "code": "PONE",
        "value": 75,
        "reason": "전후위 조합은 괜찮지만, PONE의 전략 중심 플레이와 PIBA의 즉흥성이 간혹 충돌할 수 있습니다."
      },
      {
        "code": "POBA",
        "value": 60,
        "reason": "둘 다 후위 중심이고, POBA는 전략 중심이라 감각 기반의 PIBA와 호흡이 맞지 않을 수 있습니다."
      },
      {
        "code": "POBE",
        "value": 65,
        "reason": "전략적 사고와 감각적 플레이가 충돌할 여지가 있으나, 역할 분담이 명확하다면 보완 가능합니다."
      },
      {
        "code": "PINA",
        "value": 85,
        "reason": "감각 중심 플레이어끼리이며 포지션이 분리되어 있어 유기적인 흐름과 공격 전환이 가능해집니다."
      },
      {
        "code": "PINE",
        "value": 82,
        "reason": "PINE이 전위에서 감각적으로 치고 나가고, PIBA는 후방에서 유연하게 커버해 흐름이 자연스럽습니다."
      },
      {
        "code": "PIBE",
        "value": 72,
        "reason": "비슷한 후위 감각형이라 플레이 스타일은 유사하지만, 역할 분배가 애매할 경우 리듬이 무너질 수 있습니다."
      },
      {
        "code": "CONA",
        "value": 68,
        "reason": "전위 역할 분담은 되지만, CONA의 계획 중심 움직임과 PIBA의 감각적 대응이 마찰을 일으킬 수 있습니다."
      },
      {
        "code": "CONE",
        "value": 74,
        "reason": "전후위 조합이 가능하나, 전략적 의사결정이 필요한 상황에서 감각 기반의 PIBA가 방해가 될 수 있습니다."
      },
      {
        "code": "COBA",
        "value": 55,
        "reason": "후위 포지션이 겹치고, COBA는 구조적 운영을 선호하는 반면 PIBA는 흐름 중심으로 전술적 충돌 가능성이 큽니다."
      },
      {
        "code": "COBE",
        "value": 60,
        "reason": "같은 후위 성향이며 안정성과 감각이 충돌할 수 있어 경기 템포가 무너질 위험이 있습니다."
      },
      {
        "code": "CINA",
        "value": 70,
        "reason": "포지션이 다르지만 감각 위주 성향이 유사해, 즉흥적인 조화가 가능하나 전략적인 통제가 부족할 수 있습니다."
      },
      {
        "code": "CINE",
        "value": 75,
        "reason": "전후위 포지션 분리가 되어 있으며, CINE의 감각적 후방 지원이 PIBA의 플레이를 잘 보완할 수 있습니다."
      },
      {
        "code": "CIBA",
        "value": 65,
        "reason": "유사한 감각형 후위 플레이어로 흐름은 자연스럽지만, 둘 다 베이스라인에 남는 경향이 있어 마무리가 부족할 수 있습니다."
      },
      {
        "code": "CIBE",
        "value": 70,
        "reason": "감각적 리듬이 유사해 공감대는 있으나, 명확한 전후위 분담이 없으면 경기 구조가 불안정해질 수 있습니다."
      }
    ]
  },
  {
    "code": "PIBE",
    "name": "감각적이고 즉흥적인 후위 중심 플레이어",
    "color": "#FA8E7D",
    "nickname": "본능적인 흐름 설계자",
    "description": "자신의 감각과 흐름을 따라 플레이하며, 예측하기 어려운 샷으로 상대의 리듬을 깨뜨리는 데 능합니다. 후위에서 자유롭게 움직이며 전술보다는 직관적인 선택을 중시합니다.",
    "improvement_tip": "즉흥성은 창의적 플레이로 이어질 수 있으나, 팀플레이에서는 예측 가능성과 협업이 중요합니다. 공격 시도와 수비 위치에 대한 기본적인 약속과 이해를 파트너와 공유하는 것이 좋습니다.",
    "compatibility": [
      {
        "code": "PONA",
        "value": 75,
        "reason": "강한 전위형 PONA가 마무리를 해주고, PIBE는 감각적으로 랠리를 이어가며 이상적인 전후위 분업이 가능합니다."
      },
      {
        "code": "PONE",
        "value": 72,
        "reason": "전후위 조합은 괜찮으나, PONE의 계획 중심 움직임과 PIBE의 즉흥성이 때때로 충돌할 수 있습니다."
      },
      {
        "code": "POBA",
        "value": 60,
        "reason": "후위 성향이 겹치며, 전략적이고 정제된 POBA의 리듬과 자유로운 PIBE의 플레이가 어긋날 수 있습니다."
      },
      {
        "code": "POBE",
        "value": 65,
        "reason": "POBE는 몰입 중심의 후위형으로 리듬을 중시하고, PIBE는 자유롭게 흐름을 바꾸기 때문에 충돌이 생길 수 있습니다."
      },
      {
        "code": "PINA",
        "value": 84,
        "reason": "감각적인 전위 PINA와 후위 감각형인 PIBE는 유기적으로 흐름을 연결하며 직관적 플레이가 돋보입니다."
      },
      {
        "code": "PINE",
        "value": 82,
        "reason": "감각적인 전위 PINE과의 조합은 전후위 감각 중심 흐름을 만들어내며, 예측 불가한 패턴으로 상대를 흔들 수 있습니다."
      },
      {
        "code": "PIBA",
        "value": 70,
        "reason": "후위 감각형 플레이어끼리의 호흡은 좋지만, 역할 분담이 명확하지 않으면 흐름이 꼬일 수 있습니다."
      },
      {
        "code": "CONA",
        "value": 66,
        "reason": "전위형인 CONA와의 역할 분담은 가능하나, 전략 중심 성향이 감각적인 PIBE와 자주 엇갈릴 수 있습니다."
      },
      {
        "code": "CONE",
        "value": 68,
        "reason": "정교한 전위형인 CONE과의 전후위 조합은 괜찮으나, 플레이 속도나 템포에서 차이가 있을 수 있습니다."
      },
      {
        "code": "COBA",
        "value": 58,
        "reason": "같은 후위 포지션이며, COBA는 구조적 설계를 중시해 PIBE의 자유로운 흐름을 제어하려는 경향이 있습니다."
      },
      {
        "code": "COBE",
        "value": 62,
        "reason": "후위 플레이어로 호흡은 가능하지만, COBE의 안정성과 PIBE의 즉흥성이 상호 보완보다는 간섭이 될 수 있습니다."
      },
      {
        "code": "CINA",
        "value": 73,
        "reason": "전위 감각형인 CINA와는 유사한 흐름 기반 성향으로 유기적인 연결이 가능하며, 예측 불가한 패턴을 만들 수 있습니다."
      },
      {
        "code": "CINE",
        "value": 77,
        "reason": "감각적 후위 중심의 CINE과는 플레이 리듬이 비슷하여 유기적이지만, 마무리 타이밍에서 엇갈릴 수 있습니다."
      },
      {
        "code": "CIBA",
        "value": 68,
        "reason": "비슷한 후위 감각형으로 유사성이 높지만, 역할이 겹쳐 전위 마무리가 부족할 수 있습니다."
      },
      {
        "code": "CIBE",
        "value": 70,
        "reason": "포지션, 성향이 비슷해 감각적으로 공감대는 있으나 전략적 상황에 대한 대응력이 떨어질 수 있습니다."
      }
    ]
  },

  {
    "code": "CONA",
    "name": "전략적 사고를 바탕으로 전위에서 주도하는 플레이어",
    "color": "#4C91D3",
    "nickname": "계산된 전위 지휘관",
    "description": "정확하고 정교한 샷으로 네트 앞에서 경기를 주도하며, 전략적 사고와 계획된 움직임으로 흐름을 제어하려는 성향입니다. 단순히 파워보다는 타이밍과 위치 선정으로 상대를 압박합니다.",
    "improvement_tip": "전략과 계산에 지나치게 의존하면 예측 당하거나 변칙적인 플레이에 흔들릴 수 있습니다. 감각적인 대응 능력을 키우면 경기의 유연성이 향상됩니다.",
    "compatibility": [
      {
        "code": "PONA",
        "value": 74,
        "reason": "강한 전위형인 PONA와는 역할이 겹치지만, 성향이 달라 상호 보완이 가능할 수 있습니다."
      },
      {
        "code": "PONE",
        "value": 71,
        "reason": "둘 다 전략 중심 전위 성향으로 역할이 겹쳐 협업보다 충돌이 생길 수 있으나, 명확한 분담 시 시너지도 기대됩니다."
      },
      {
        "code": "POBA",
        "value": 85,
        "reason": "POBA의 안정적인 후위 운영은 CONA의 전위 전략을 더욱 빛나게 하며, 전후위 균형이 매우 우수합니다."
      },
      {
        "code": "POBE",
        "value": 88,
        "reason": "계획 중심의 후위 설계자인 POBE와의 조합은 CONA에게 전술적 자유도를 높여주며 매우 이상적인 파트너입니다."
      },
      {
        "code": "PINA",
        "value": 62,
        "reason": "감각 위주의 PINA와 전략 중심의 CONA는 전위에서 역할이 겹치고 리듬 충돌이 잦을 수 있습니다."
      },
      {
        "code": "PINE",
        "value": 65,
        "reason": "PINE의 즉흥성은 CONA의 계획적인 흐름에 혼란을 줄 수 있으며, 포지션 중복도 있습니다."
      },
      {
        "code": "PIBA",
        "value": 72,
        "reason": "후위 감각형 PIBA는 전위 중심의 CONA를 보완할 수 있으나, 사고 방식 차이로 인해 조율이 필요합니다."
      },
      {
        "code": "PIBE",
        "value": 68,
        "reason": "PIBE의 즉흥적 흐름이 CONA의 전략적인 접근과 맞지 않아 협업에 시간이 걸릴 수 있습니다."
      },
      {
        "code": "CONE",
        "value": 77,
        "reason": "비슷한 전략형 전위 성향으로 이해도는 높지만, 역할 분담이 명확하지 않으면 중복 우려가 있습니다."
      },
      {
        "code": "COBA",
        "value": 90,
        "reason": "전략적 후위 설계자인 COBA와는 전후위 분담이 뛰어나며, 서로의 사고 방식이 잘 맞아 전술 완성도가 높습니다."
      },
      {
        "code": "COBE",
        "value": 86,
        "reason": "COBE의 안정적인 랠리 조율이 CONA의 전위 주도 플레이를 든든히 받쳐주는 이상적인 조합입니다."
      },
      {
        "code": "CINA",
        "value": 66,
        "reason": "CINA는 감각형 전위 성향으로 CONA와 성향은 다르지만 역할은 겹쳐 혼란이 있을 수 있습니다."
      },
      {
        "code": "CINE",
        "value": 80,
        "reason": "후위 감각형인 CINE과의 조합은 리듬 차이가 있지만, 전후위 분업은 비교적 안정적입니다."
      },
      {
        "code": "CIBA",
        "value": 70,
        "reason": "감각형 후위 성향인 CIBA는 CONA의 전략적 흐름을 보완할 수 있으나, 협업 호흡에 시간이 걸릴 수 있습니다."
      },
      {
        "code": "CIBE",
        "value": 73,
        "reason": "감각 중심의 후위 플레이어로, CONA와 사고 방식이 다르지만 전후위 포지션 조합은 괜찮은 편입니다."
      }
    ]
  },
  {
    "code": "CONE",
    "name": "정밀한 전술로 전위에서 흐름을 설계하는 플레이어",
    "color": "#5FB2B2",
    "nickname": "냉정한 전위 설계자",
    "description": "네트 앞에서 정확한 판단과 위치 선점으로 경기를 설계하며, 실수보다는 효율을 중시하는 전략적 전위 성향입니다. 뛰어난 판단력과 집중력으로 상대를 압박하고 경기를 주도하려는 경향이 강합니다.",
    "improvement_tip": "계획대로 경기가 흘러가지 않을 때 융통성이 부족해 흔들릴 수 있습니다. 감각적인 즉흥 대응 능력을 기르면 안정감 있는 전략가로 거듭날 수 있습니다.",
    "compatibility": [
      {
        "code": "PONA",
        "value": 75,
        "reason": "강한 임팩트를 가진 PONA와는 전위 성향이 겹치지만, 전략 중심인 CONE과 파워 중심인 PONA의 조화가 가능할 수 있습니다."
      },
      {
        "code": "PONE",
        "value": 70,
        "reason": "역할이 유사한 전위 전략형으로 이해도는 높지만, 전위 중복으로 인한 리스크가 존재합니다."
      },
      {
        "code": "POBA",
        "value": 85,
        "reason": "POBA의 후위 안정성이 CONE의 전위 설계와 잘 맞아 이상적인 전후위 전술 구성이 가능합니다."
      },
      {
        "code": "POBE",
        "value": 90,
        "reason": "전략적 사고를 공유하는 후위 플레이어인 POBE와의 조합은 높은 전술 완성도와 안정된 밸런스를 이룹니다."
      },
      {
        "code": "PINA",
        "value": 64,
        "reason": "즉흥적이고 감각 중심의 PINA와는 플레이 방식이 달라 협업보다는 충돌이 잦을 수 있습니다."
      },
      {
        "code": "PINE",
        "value": 67,
        "reason": "감각적이고 빠른 전위 플레이어인 PINE과는 역할이 겹쳐 공간 중복 및 리듬 충돌 가능성이 있습니다."
      },
      {
        "code": "PIBA",
        "value": 73,
        "reason": "즉흥형 후위 플레이어인 PIBA와는 전술적인 호흡에 시간이 필요하지만, 명확한 역할 분담으로 상호 보완이 가능합니다."
      },
      {
        "code": "PIBE",
        "value": 76,
        "reason": "감각형 후위 성향인 PIBE는 자유롭게 흐름을 만들고, CONE은 이를 전략적으로 마무리할 수 있어 균형을 이룹니다."
      },
      {
        "code": "CONA",
        "value": 78,
        "reason": "전위 전략형인 CONA와는 비슷한 성향으로 이해도는 높지만, 역할 분리가 명확하지 않으면 중복될 수 있습니다."
      },
      {
        "code": "COBA",
        "value": 91,
        "reason": "전략 중심의 후위 지휘관 COBA와는 사고 방식이 잘 맞고, 전후위 분업이 뛰어나 전술 효율이 극대화됩니다."
      },
      {
        "code": "COBE",
        "value": 87,
        "reason": "안정적인 랠리 운영을 하는 COBE는 CONE의 전위 플레이를 안정적으로 받쳐줄 수 있는 최적의 후위 파트너입니다."
      },
      {
        "code": "CINA",
        "value": 65,
        "reason": "감각 중심의 CINA와는 사고 방식의 차이로 인해 조율이 필요하며, 전위 성향이 겹쳐 공간 분배에 주의가 필요합니다."
      },
      {
        "code": "CINE",
        "value": 79,
        "reason": "후위 감각형인 CINE과는 전후위 균형은 우수하나, 전략적 흐름과 감각 리듬의 차이가 조율 포인트가 될 수 있습니다."
      },
      {
        "code": "CIBA",
        "value": 71,
        "reason": "CIBA의 감각적인 후위 대응은 변칙적인 상황에서 도움이 되지만, 전략 흐름과 충돌할 가능성도 있습니다."
      },
      {
        "code": "CIBE",
        "value": 74,
        "reason": "감각 위주 플레이어로, 스타일은 다르지만 전후위 분담이 명확하면 시너지를 낼 수 있는 조합입니다."
      }
    ]
  },
  {
    "code": "COBA",
    "name": "정확한 조율과 안정적 운영을 중시하는 후위 지휘관",
    "color": "#3E77C2",
    "nickname": "전술 설계형 랠리 마스터",
    "description": "후방에서 정확한 샷과 뛰어난 위치 선정으로 경기를 조율하며, 실수 없이 안정적인 흐름을 만들어내는 전략적 후위 성향입니다. 파트너를 믿고 뒷받침하며 전체적인 경기 구도를 설계하려는 성향이 강합니다.",
    "improvement_tip": "너무 안전하게만 운영하면 예측당하거나 흐름이 단조로워질 수 있습니다. 변칙적이고 공격적인 선택지를 늘리면 더 유연한 플레이가 가능합니다.",
    "compatibility": [
      {
        "code": "PONA",
        "value": 86,
        "reason": "PONA의 전위 침투 플레이를 후위에서 안정적으로 설계해주는 조합으로, 전후위 밸런스가 매우 우수합니다."
      },
      {
        "code": "PONE",
        "value": 84,
        "reason": "강한 전위 성향의 PONE과 COBA는 명확한 역할 분담으로 조직적인 팀 전술을 구축할 수 있습니다."
      },
      {
        "code": "POBA",
        "value": 70,
        "reason": "같은 후위 성향이라 수비적 안정감은 있지만, 마무리 능력이 부족해 흐름이 길어질 수 있습니다."
      },
      {
        "code": "POBE",
        "value": 74,
        "reason": "전략적 사고가 유사하지만 역할이 겹치기 쉬워 조율이 필요합니다."
      },
      {
        "code": "PINA",
        "value": 92,
        "reason": "감각적인 전위 공격수 PINA와의 조합은 COBA의 계획적 후위 운영을 바탕으로 이상적인 공격 밸런스를 이룹니다."
      },
      {
        "code": "PINE",
        "value": 89,
        "reason": "즉흥적인 전위 도전자 PINE을 뒤에서 안정적으로 뒷받침하며 흐름을 통제할 수 있는 상호보완 조합입니다."
      },
      {
        "code": "PIBA",
        "value": 63,
        "reason": "두 사람 모두 후위 중심이지만, COBA는 계획 중심이고 PIBA는 즉흥적인 스타일로 충돌이 잦을 수 있습니다."
      },
      {
        "code": "PIBE",
        "value": 67,
        "reason": "스타일이 다르지만 전후위로 구분되면 창의성과 안정성이 조화를 이룰 수 있습니다."
      },
      {
        "code": "CONA",
        "value": 83,
        "reason": "전위에서 정확하게 설계하는 CONA와는 뛰어난 전후위 분업으로 전략적 효율이 높습니다."
      },
      {
        "code": "CONE",
        "value": 91,
        "reason": "정교한 전위 설계자인 CONE과 COBA는 전략 중심의 플레이스타일이 유사하여 탁월한 호흡을 보여줍니다."
      },
      {
        "code": "COBE",
        "value": 76,
        "reason": "유사한 후위 안정형 성향이지만 역할이 겹칠 수 있어 조율과 구분이 중요합니다."
      },
      {
        "code": "CINA",
        "value": 81,
        "reason": "전위 감각형인 CINA와는 전후위 조합이 가능하며, COBA가 전체 흐름을 조율하고 CINA가 즉흥적으로 기회를 만드는 흐름이 좋습니다."
      },
      {
        "code": "CINE",
        "value": 78,
        "reason": "감각적인 후위 대응이 가능한 CINE과는 사고방식이 다르지만, 서로의 장점을 살리면 안정성과 유연함을 동시에 가질 수 있습니다."
      },
      {
        "code": "CIBA",
        "value": 62,
        "reason": "후위 위치가 겹치고, 감각적이지만 변칙적인 CIBA의 플레이는 COBA의 전략적 흐름을 방해할 수 있습니다."
      },
      {
        "code": "CIBE",
        "value": 65,
        "reason": "CIBE의 감각 위주 플레이가 COBA의 예측 가능한 조율 흐름과 맞지 않아 호흡이 어긋날 수 있습니다."
      }
    ]
  },
  {
    "code": "COBE",
    "name": "정확한 조율과 안정적 운영을 중시하는 후위 플레이어",
    "color": "#5A9C94",
    "nickname": "정밀 설계자",
    "description": "후위에서 실수를 줄이고 흐름을 컨트롤하며, 안정적인 베이스라인 운영을 통해 경기를 조율하는 성향입니다. 샷의 정밀도와 리듬감을 중요하게 생각하며, 예측 가능한 움직임으로 팀 전체를 안정화시킵니다.",
    "improvement_tip": "너무 계산적으로 접근하면 예측당하거나 플레이가 단조로워질 수 있습니다. 창의적이고 변칙적인 시도를 조금 더 추가하면 전략적 다양성이 생깁니다.",
    "compatibility": [
      {
        "code": "PONA",
        "value": 90,
        "reason": "전위에서 강하게 돌파하는 PONA의 플레이를 안정적인 후위 운영으로 뒷받침하며 역할 분담이 명확합니다."
      },
      {
        "code": "PONE",
        "value": 88,
        "reason": "PONE의 공격적 전위 스타일과 COBE의 안정적 후위 스타일이 조화를 이루며, 효율적인 전후위 밸런스를 구성합니다."
      },
      {
        "code": "POBA",
        "value": 72,
        "reason": "두 사람 모두 후위 성향으로 안정감은 있으나, 공격 전환에서 무게 중심이 뒤로 쏠릴 수 있습니다."
      },
      {
        "code": "POBE",
        "value": 75,
        "reason": "POBE와 유사한 후위 안정형이지만 스타일이 너무 겹치면 팀 내 역동성이 부족해질 수 있습니다."
      },
      {
        "code": "PINA",
        "value": 94,
        "reason": "감각적인 전위 공격수 PINA를 COBE가 후위에서 조율해주며, 전후위 역할 분담이 뛰어나고 흐름의 균형이 이상적입니다."
      },
      {
        "code": "PINE",
        "value": 91,
        "reason": "즉흥적인 전위 도전자 PINE의 감각적인 플레이를 COBE가 뒷받침하며 안정성과 변칙성이 공존하는 조합이 됩니다."
      },
      {
        "code": "PIBA",
        "value": 66,
        "reason": "후위 성향이 겹치며, PIBA의 즉흥성과 COBE의 안정성이 충돌할 수 있어 경기 운영에서 갈등이 생길 수 있습니다."
      },
      {
        "code": "PIBE",
        "value": 70,
        "reason": "CIBE와는 감각과 전략이라는 상반된 접근 방식이 조화를 이룰 수도 있지만 리듬 충돌 가능성도 있습니다."
      },
      {
        "code": "CONA",
        "value": 84,
        "reason": "전위에서 정확하게 설계하는 CONA와 COBE는 각자의 영역에서 안정적인 구조를 유지하며 조직적인 플레이를 펼칠 수 있습니다."
      },
      {
        "code": "CONE",
        "value": 87,
        "reason": "정교한 전위 설계자인 CONE과 COBE는 함께 플레이 시 실수가 적고, 전술적 완성도가 높습니다."
      },
      {
        "code": "COBA",
        "value": 78,
        "reason": "같은 후위 안정형 조합으로 리듬은 잘 맞지만, 공격적인 마무리에서 약점을 보일 수 있습니다."
      },
      {
        "code": "CINA",
        "value": 80,
        "reason": "감각적인 전위형 CINA와는 포지션 분담이 잘 되고, COBE가 흐름을 조율해 전체 경기 리듬을 안정화할 수 있습니다."
      },
      {
        "code": "CINE",
        "value": 76,
        "reason": "비슷한 감각 기반 성향이지만, 포지션 구분이 잘 되면 유연한 감각 중심 플레이와 조화될 수 있습니다."
      },
      {
        "code": "CIBA",
        "value": 68,
        "reason": "둘 다 후위 성향이며, CIBA의 즉흥성이 COBE의 계획 중심 운영과 충돌해 호흡이 어긋날 수 있습니다."
      },
      {
        "code": "CIBE",
        "value": 70,
        "reason": "같은 후위 성향이지만 CIBE의 감각 위주 플레이가 COBE의 예측 중심 운영 흐름을 흔들 수 있습니다."
      }
    ]
  },
  {
    "code": "CINA",
    "name": "감각과 정확함을 겸비한 유연한 전위 플레이어",
    "color": "#7A70D6",
    "nickname": "섬세한 파이터",
    "description": "전위에서 빠르게 반응하고 직관적인 선택으로 찬스를 만들어내는 성향입니다. 감각적인 플레이를 바탕으로 하되, 기본적인 안정성과 정확성도 갖추고 있어 흐름을 무너뜨리지 않으면서 창의적인 전개가 가능합니다.",
    "improvement_tip": "순간 감각에 의존하는 선택이 늘어나면 일관성이 떨어질 수 있으므로, 상황을 미리 예측하고 시나리오 기반 플레이를 일부 섞으면 더욱 안정적인 성장을 도모할 수 있습니다.",
    "compatibility": [
      {
        "code": "PONA",
        "value": 89,
        "reason": "강한 임팩트를 추구하는 PONA의 플레이를 직관적으로 보완하며, 전후위 간의 상호작용이 유기적입니다."
      },
      {
        "code": "PONE",
        "value": 86,
        "reason": "PONE의 전술적 전위 운영에 감각적으로 조응하며, 유연한 움직임으로 리듬을 유지해줍니다."
      },
      {
        "code": "POBA",
        "value": 82,
        "reason": "POBA가 후위에서 구조를 설계하면, CINA가 전위에서 민첩하게 대응하며 이상적인 조합이 만들어집니다."
      },
      {
        "code": "POBE",
        "value": 84,
        "reason": "POBE의 전략적인 후위 운영에 유연한 전위 감각이 더해져 균형 잡힌 흐름을 유지할 수 있습니다."
      },
      {
        "code": "PINA",
        "value": 77,
        "reason": "감각적인 플레이가 겹치면서 공간 중복과 흐름 충돌이 생길 수 있으나, 잘 맞추면 강력한 전위 듀오가 될 수 있습니다."
      },
      {
        "code": "PINE",
        "value": 75,
        "reason": "감각 중심 성향은 유사하지만 전위 겹침과 순간 선택의 방향성이 다를 수 있어 마찰이 생기기 쉽습니다."
      },
      {
        "code": "PIBA",
        "value": 80,
        "reason": "PIBA의 즉흥적인 후위 공격에 CINA가 감각적으로 응수해 공격 흐름을 빠르게 만들어낼 수 있습니다."
      },
      {
        "code": "PIBE",
        "value": 83,
        "reason": "PIBE의 창의적인 후위 설계와 CINA의 민첩한 전위 대응이 조화를 이룹니다."
      },
      {
        "code": "CONA",
        "value": 88,
        "reason": "전위 포지션이 같지만 CONA는 계획 중심, CINA는 감각 중심이라 서로의 부족한 부분을 보완해줄 수 있습니다."
      },
      {
        "code": "CONE",
        "value": 85,
        "reason": "CONE의 분석적인 리딩과 CINA의 유연한 전개가 결합되어 안정적이면서도 창의적인 전술이 가능합니다."
      },
      {
        "code": "COBA",
        "value": 90,
        "reason": "후위에서 리듬을 만들어주는 COBA와 함께하면, CINA가 전위에서 자연스럽게 플레이를 전개할 수 있습니다."
      },
      {
        "code": "COBE",
        "value": 87,
        "reason": "COBE의 안정적인 흐름 제어에 감각적이고 빠른 전위 반응이 더해져 완성도 높은 팀워크를 기대할 수 있습니다."
      },
      {
        "code": "CINE",
        "value": 79,
        "reason": "비슷한 포지션과 감각 중심의 플레이로 인해 겹치는 부분이 많아 전위 중복 문제가 생길 수 있습니다."
      },
      {
        "code": "CIBA",
        "value": 83,
        "reason": "CIBA의 후방 감각 운영과 CINA의 전위 감각 플레이가 잘 어우러지며 리듬이 유연하게 연결됩니다."
      },
      {
        "code": "CIBE",
        "value": 84,
        "reason": "창의적인 후위 흐름을 만들어주는 CIBE와 함께하면, CINA의 민첩하고 감각적인 플레이가 빛을 발합니다."
      }
    ]
  },
  {
    "code": "CINE",
    "name": "감각과 안정성을 겸비한 부드러운 후위 플레이어",
    "color": "#A678E4",
    "nickname": "리듬 메이커",
    "description": "후위에서 감각적으로 경기의 흐름을 읽고 유연하게 대처하는 성향입니다. 안정적인 기본기를 바탕으로 직관적인 리딩과 창의적인 연결 능력을 갖추고 있어, 파트너의 성향을 자연스럽게 보완하며 경기 리듬을 만들어냅니다.",
    "improvement_tip": "너무 감각에 의존할 경우 플레이의 일관성이 약해질 수 있으므로, 시나리오 기반의 전략 운영을 병행하면 완성도가 더욱 높아질 수 있습니다.",
    "compatibility": [
      {
        "code": "PONA",
        "value": 92,
        "reason": "PONA의 강한 전위 공격을 후방에서 부드럽게 연결하고 커버할 수 있어 전후위 조합이 탁월합니다."
      },
      {
        "code": "PONE",
        "value": 90,
        "reason": "PONE의 전략적 전위 운영을 감각적으로 뒷받침해주며, 흐름과 리듬을 안정화시킬 수 있습니다."
      },
      {
        "code": "POBA",
        "value": 85,
        "reason": "두 명 모두 후위 성향이지만 CINE의 감각성과 POBA의 전략성이 잘 어우러지면 새로운 공격 기회를 창출할 수 있습니다."
      },
      {
        "code": "POBE",
        "value": 86,
        "reason": "후위에서 안정적으로 설계하는 POBE와 감각적으로 대응하는 CINE은 유연하고 리듬 있는 수비-공격 전환이 가능합니다."
      },
      {
        "code": "PINA",
        "value": 89,
        "reason": "감각적인 전위 플레이어인 PINA와 감각적인 후위 운영의 CINE이 만나 빠르고 유기적인 플레이 흐름을 만듭니다."
      },
      {
        "code": "PINE",
        "value": 87,
        "reason": "PINE의 직관적인 전위 공격을 부드럽게 이어주는 후방 감각형으로, 리스크를 안정적으로 조율합니다."
      },
      {
        "code": "PIBA",
        "value": 81,
        "reason": "둘 다 후위 성향이나 CINE은 안정 중심, PIBA는 즉흥 중심이라 조화를 잘 맞추면 균형 잡힌 흐름이 가능합니다."
      },
      {
        "code": "PIBE",
        "value": 82,
        "reason": "감각 중심 성향이 유사해 감정적인 리듬을 잘 타지만, 전략 부재 시 위험성이 존재합니다."
      },
      {
        "code": "CONA",
        "value": 84,
        "reason": "전위에서 계획적으로 움직이는 CONA를 유연하게 백업하며 팀 전체의 완성도를 높일 수 있습니다."
      },
      {
        "code": "CONE",
        "value": 86,
        "reason": "전위에서 전략적으로 설계하는 CONE의 플레이를 부드럽게 받아주며, 리듬 있는 경기 흐름을 만듭니다."
      },
      {
        "code": "COBA",
        "value": 80,
        "reason": "둘 다 후위 성향으로 수비적인 조합이 될 수 있지만, CINE이 감각적인 전환을 통해 변화를 줄 수 있습니다."
      },
      {
        "code": "COBE",
        "value": 83,
        "reason": "COBE의 안정성과 CINE의 감각이 조화를 이루면, 전술적으로 부드럽고 리드미컬한 경기를 유도할 수 있습니다."
      },
      {
        "code": "CINA",
        "value": 78,
        "reason": "전위 겹침은 없지만, 감각 중심 성향이 겹쳐 리듬이 지나치게 즉흥적으로 흐를 수 있습니다."
      },
      {
        "code": "CIBA",
        "value": 80,
        "reason": "CIBA의 즉흥적인 감각 후위 운영을 CINE이 안정적으로 맞춰가면 창의적이면서도 안정된 플레이가 가능합니다."
      },
      {
        "code": "CIBE",
        "value": 82,
        "reason": "감각 기반 후위 조합으로 유연한 흐름을 만들 수 있으나, 전략적 틀 없이 플레이가 흘러갈 수 있어 약간의 설계 필요"
      }
    ]
  },
  {
    "code": "CIBA",
    "name": "감각과 도전정신이 살아있는 즉흥 후위 플레이어",
    "color": "#6E88C9",
    "nickname": "창의적 후방 싸움꾼",
    "description": "후방에서 유연하게 경기 흐름을 읽고, 순간적인 감각으로 경기를 풀어나가는 성향입니다. 경기 흐름을 즐기며 적극적인 전환 플레이와 위기 돌파 능력이 뛰어난 편입니다. 전통적인 전략보다는 직관과 경험을 바탕으로 게임을 만들어 갑니다.",
    "improvement_tip": "즉흥성과 감각에만 의존하면 리듬이 흔들릴 수 있으므로, 기본적인 전략 플랜을 갖추고 변칙 플레이와 병행하면 더욱 완성도 높은 경기를 펼칠 수 있습니다.",
    "compatibility": [
      {
        "code": "PONA",
        "value": 78,
        "reason": "강한 전략 중심 성향의 PONA와 즉흥적인 감각형인 CIBA는 리듬이 쉽게 엇갈릴 수 있어 긴밀한 조율이 필요합니다."
      },
      {
        "code": "PONE",
        "value": 76,
        "reason": "계획적인 전위 운영을 중시하는 PONE과는 사고방식이 달라 경기 중 협업의 리듬을 맞추는 데 어려움이 있을 수 있습니다."
      },
      {
        "code": "POBA",
        "value": 83,
        "reason": "전략 중심의 후위형 POBA를 감각적으로 보완할 수 있어, 서로 다른 성향이 시너지를 낼 수 있는 조합입니다."
      },
      {
        "code": "POBE",
        "value": 84,
        "reason": "POBE가 구조를 만들고 CIBA가 감각적으로 흐름을 흔들면 다채로운 후위 운영이 가능합니다."
      },
      {
        "code": "PINA",
        "value": 89,
        "reason": "감각 중심의 전위형 PINA와 유연한 후위형인 CIBA는 직관적이고 빠른 템포의 경기 흐름을 만들어낼 수 있습니다."
      },
      {
        "code": "PINE",
        "value": 87,
        "reason": "PINE이 전위에서 직감적으로 움직이고, CIBA가 그 흐름을 감각적으로 이어받는 조합은 공격적인 리듬을 만들어냅니다."
      },
      {
        "code": "PIBA",
        "value": 90,
        "reason": "감각 기반의 후위 도전자끼리의 조합으로, 리듬과 흐름이 자연스럽게 연결되어 유기적인 플레이가 가능합니다."
      },
      {
        "code": "PIBE",
        "value": 92,
        "reason": "감각적이고 즉흥적인 플레이스타일이 매우 유사하여 서로의 움직임을 직관적으로 이해하고 호흡을 맞출 수 있습니다."
      },
      {
        "code": "CONA",
        "value": 74,
        "reason": "정제되고 계산된 전위 설계자와 감각형 후위 플레이어의 결합은 리듬 충돌 가능성이 있으나, 역할 분담이 명확하면 보완이 가능합니다."
      },
      {
        "code": "CONE",
        "value": 76,
        "reason": "계획 중심의 전위 플레이어와는 사고방식에서 충돌할 수 있으며, 경기 운영 스타일에서 큰 차이를 보일 수 있습니다."
      },
      {
        "code": "COBA",
        "value": 70,
        "reason": "같은 후위 성향이면서 COBA는 계획형, CIBA는 감각형으로 전술적 충돌과 리듬 붕괴 위험이 존재합니다."
      },
      {
        "code": "COBE",
        "value": 73,
        "reason": "COBE의 안정적 운영과 CIBA의 유연한 흐름이 상호 보완될 수도 있으나, 정적인 흐름에 CIBA가 답답함을 느낄 수 있습니다."
      },
      {
        "code": "CINA",
        "value": 86,
        "reason": "CINA가 감각적으로 경기 흐름을 설계하고, CIBA가 유연하게 이를 실행에 옮기며 창의적인 후위 콤비가 가능합니다."
      },
      {
        "code": "CINE",
        "value": 85,
        "reason": "CINE이 전체 리듬을 읽고 안정적으로 조율할 수 있어, 감각형인 CIBA의 예측 불가한 흐름과 잘 조화를 이룰 수 있습니다."
      },
      {
        "code": "CIBE",
        "value": 93,
        "reason": "감각 중심의 후위 플레이어끼리의 조합으로, 리듬과 감정 호흡이 잘 맞으며 창의적인 플레이가 자연스럽게 연결됩니다."
      }
    ]
  },
  {
    "code": "CIBE",
    "name": "즉흥성과 안정감을 동시에 갖춘 감각적 후위 플레이어",
    "color": "#8DA8A1",
    "nickname": "부드러운 리듬 메이커",
    "description": "정확한 기본기를 바탕으로 순간적인 감각과 직관으로 경기를 풀어가는 성향입니다. 후방에서 안정적인 운영을 유지하면서도 예측하기 어려운 감각적인 플레이를 통해 상대의 허점을 파고드는 능력이 뛰어납니다.",
    "improvement_tip": "감각에만 의존할 경우 일관성이 떨어질 수 있으므로, 상황별 플랜을 미리 준비해두면 경기 운영이 더욱 안정화됩니다.",
    "compatibility": [
      {
        "code": "PONA",
        "value": 82,
        "reason": "PONA의 강한 공격 흐름에 CIBE가 부드럽고 감각적인 후방 지원을 더해 안정성과 리듬의 균형을 맞출 수 있습니다."
      },
      {
        "code": "PONE",
        "value": 80,
        "reason": "PONE의 전위 압박 플레이를 CIBE가 후방에서 유연하게 조율하며 전후위의 시너지를 만들 수 있습니다."
      },
      {
        "code": "POBA",
        "value": 75,
        "reason": "POBA와 역할이 겹칠 수 있으나, CIBE의 감각이 POBA의 정형적인 후위 운영을 부드럽게 만들어줄 수 있습니다."
      },
      {
        "code": "POBE",
        "value": 78,
        "reason": "전략 중심의 POBE와 감각 중심의 CIBE는 상호 보완적인 관계로, 의사소통만 원활하면 좋은 밸런스를 이룰 수 있습니다."
      },
      {
        "code": "PINA",
        "value": 91,
        "reason": "감각적이고 적극적인 전위형 PINA와 후위에서 조율하는 CIBE는 리듬과 흐름이 매우 잘 맞습니다."
      },
      {
        "code": "PINE",
        "value": 88,
        "reason": "즉흥적이고 감각적인 전위형 PINE의 움직임을 CIBE가 후위에서 유연하게 커버하며 전후 균형이 뛰어납니다."
      },
      {
        "code": "PIBA",
        "value": 89,
        "reason": "같은 후위 성향이지만 감각과 리듬이 유사하여 서로를 방해하지 않고 창의적인 콤비 플레이가 가능합니다."
      },
      {
        "code": "PIBE",
        "value": 94,
        "reason": "감각 중심의 후위 플레이어끼리의 조합으로 경기 리듬과 플레이 감성이 잘 맞아 높은 궁합을 자랑합니다."
      },
      {
        "code": "CONA",
        "value": 79,
        "reason": "전위에서 전략적으로 경기를 설계하는 CONA와 감각적인 후위형인 CIBE는 전후위 분담이 명확하여 협업이 잘 이뤄질 수 있습니다."
      },
      {
        "code": "CONE",
        "value": 77,
        "reason": "CONE의 계획적인 전위 움직임을 CIBE가 감각적으로 맞춰주며, 서로 부족한 부분을 채워줄 수 있는 조합입니다."
      },
      {
        "code": "COBA",
        "value": 71,
        "reason": "같은 후위 성향이지만 COBA는 정교하고 계산적인 반면, CIBE는 즉흥적이기 때문에 리듬의 충돌 가능성이 있습니다."
      },
      {
        "code": "COBE",
        "value": 74,
        "reason": "전략 중심의 COBE와 감각적인 CIBE는 서로 스타일이 달라 충돌할 수 있으나, 의사소통을 통해 보완 가능합니다."
      },
      {
        "code": "CINA",
        "value": 87,
        "reason": "CINA가 감각적으로 경기 흐름을 주도하고 CIBE가 이를 유연하게 따라가면서 자연스러운 후방 리듬을 형성할 수 있습니다."
      },
      {
        "code": "CINE",
        "value": 90,
        "reason": "감각과 안정성을 두루 갖춘 CINE과 함께하면, 두 사람의 흐름이 부드럽고 유기적으로 맞물려 좋은 호흡을 기대할 수 있습니다."
      },
      {
        "code": "CIBA",
        "value": 93,
        "reason": "감각 기반 후위 플레이어끼리의 조합으로, 플레이 리듬과 경기 스타일이 매우 유사해 자연스럽게 호흡이 맞습니다."
      }
    ]
  }
]
